export const objects = [
    {
        id: 1,
        title: "Электромагнитный шести стрелочный телеграфный аппарат Шиллинга",
        description: `Первый в мире практически пригодный электромагнитный телеграф сконструировал в 1832 году российский ученый, член-корреспондент Санкт-Петербургской Академии наук Павел Львович Шиллинг фон Канштадт.
В шести стрелочном аппарате Шиллинга кодирование сообщений производилось равномерным шестизначным кодом. Для передачи сигналов требовалось нажать комбинацию из черных и белых клавиш в передатчике.
При этом сигнальные кружки, управляемые магнитными стрелками, поворачивались к наблюдателю черной или белой стороной.
Хотя изобретатель умер достаточно рано, но его изобретение дало сильный толчок в развитии телеграфа.`
    },
    {
        id: 2,
        title: "Буквопечатающий телеграфный аппарат Юза с моторным приводом",
        description: `Данный аппарат был изобретен на основе изобретения Дэвида Эдварда Юза и использовался на территории СССР вплоть до 1930.
Работа аппарата основана на одновременном вращении в передающем и приемном аппаратах типовых колес с выгравированными по окружности типами — буквами, цифрами и другими знаками. Для передачи сообщений служила клавиатура, состоящая из 28 белых и черных клавиш.
Каждый знак передавался нажатием одной клавиши — в линию посылался один импульс тока. При приеме знака срабатывает привод, приемный механизм прижимает телеграфную ленту к смоченному краской колесу с объемными буквами, а затем продвигает ленту дальше.`
    },
    {
        id: 3,
        title: "Радио Попова",
        description: `Прибор для обнаружения и регистрирования электрических колебаний концептуально ничем не отличается от современных радиоприемников. Но в своё время это было очень большим достижением, поскольку Александру Степановичу удалось решить проблему - восстановление состояния приёмника по окончанию приёма сигнала.
То есть - ранее радио регистрирующие устройства использовали для регистрации порошок из проводящих материалов, который под действием тока "спекался", после чего его сопротивление падало и сигнал проходил. Но проблема заключалась в том, что порошок сам в исходное состояние не приходил и требовалось вмешательство извне, что и исправил Попов.`
    },
    {
        id: 4,
        title: "Фототелеграфный аппарат ФТ-3",
        description: `Фототелеграф устройство, предназначенное для передачи фотоизображений, чертежей, текстов и других графических материалов по телефонным или телеграфным каналам связи. Была начата эксплуатация в 1930-х годах.`
    },
    {
        id: 5,
        title: "Коммутатор ручной Центральной телефонный станции (коммутатор Гейслера)",
        description: `Центральная ручная телефонная станция в Санкт-Петербурге начала работу в 1905 году. На ручной телефонной станции абонентов соединяли с помощью телефонных коммутаторов, обслуживаемых вручную телефонистками.
На станции было две группы коммутаторов: А и Б. Емкость каждой группы — 20 тысяч номеров. Каждый телефонный номер был подключен только к одной группе коммутаторов. Если была необходимость соединить абонентов из разных групп, за соединение коммутаторов отвечали отдельные телефонистки.
В дальнейшем емкость увеличивалась путем модернизации вплоть до 1950, когда ручной коммутатор заменили на автоматический.`
    },
    {
        id: 6,
        title: "Электромагнитный шести стрелочный телеграфный аппарат Шиллинга",
        description: `Аппарат СТ-35 создан советскими инженерами в 1935 году. Он является наиболее распространенным, массовым аппаратом на наших телеграфных линиях. Работа аппарата СТ-35 основана на так называемом старт стопном принципе.
При нажатии на клавишу в линию посылаются электрические сигналы по определенному коду. По сути это просто пишущая машинка с возможностью отправки текста.`
    },
    {
        id: 7,
        title: "Фототелеграфный аппарат «Нева ФТА-2М»",
        description: `Выражаясь на сегодняшний манер - принтер. Выпуск подобных аппаратов начался в 1930-х годах.
Для передачи изображения лист с рисунком накладывался на вращающийся барабан передающего факсимильного аппарата и освещался узким пучком света. Свет преобразовывался в электрический сигнал, содержащий информацию о передаваемом рисунке, который передавался по каналам связи.
Из линии связи этот электрический сигнал поступал на приемное фото телеграфное устройство, имевшее такой же барабан. На него накладывался лист фотобумаги. Приемный барабан освещался узким пучком света, сила которого менялась в соответствии с принимаемым сигналом.
При вращении барабана на различные участки фотобумаги попадал свет различной яркости в соответствии с распределением тёмных и светлых участков на оригинальном рисунке.
Можно считать это дедушкой современных барабанных принтеров.`
    },
    {
        id: 8,
        title: "Телерадиола «Ленинград Т-3»",
        description: `Телерадиола чёрно-белого изображения «Ленинград Т-3» объединяет телевизор, радиоприемник и проигрыватель грампластинок. Опытный выпуск таких комплексов был начат в конце 1948 года.
Встроенный телевизор с большим по тем временам экраном мог принимать телевизионные программы по трем каналам. Экран закрывается распашными дверцами. Акустическая система состоит из четырех разных полосных громкоговорителей, один из которых расположен под экраном.`
    }
];

export const points = [
    {
        "title": "Дом П.Л. Шиллинга на Миллионной улице: Место создания электромагнитного телеграфа",
        "description": "В этом доме Павел Львович Шиллинг разрабатывал и собрал первый образец шестистрелочного электромагнитного телеграфа. Здесь в 1832 году были проведены ключевые эксперименты, подтвердившие работоспособность аппарата. Здание сохранилось в историческом центре Санкт-Петербурга.",
        "longitude": 30.3325,
        "latitude": 59.9417,
        "address": "Россия, Санкт-Петербург, Миллионная улица, 7",
        "source": "https://www.openstreetmap.org/node/10908742800",
        "parentid": 1
    },
    {
        "title": "Здание Главного Адмиралтейства: Первая публичная демонстрация телеграфа",
        "description": "В западном крыле Адмиралтейства в октябре 1832 года Шиллинг провел успешную демонстрацию телеграфа для государственной комиссии. Аппарат передавал сигналы между комнатами на расстояние 100 м, что подтвердило его практическую пригодность. Событие стало отправной точкой для развития телеграфной связи в России.",
        "longitude": 30.3086,
        "latitude": 59.9375,
        "address": "Россия, Санкт-Петербург, Адмиралтейский проезд, 1",
        "source": "https://yandex.ru/maps/org/glavnoye_admiralteystvo/1064799215/",
        "parentid": 1
    },
    {
        "title": "Акционерное общество русских электрических заводов «Сименс и Гальске»: Производство аппаратов Юза",
        "description": "На этом заводе в Санкт-Петербурге с 1898 по 1917 гг. производились буквопечатающие телеграфные аппараты Юза с моторным приводом. Предприятие выпускало оборудование для телеграфных линий Российской империи, включая модернизированные модели с приводом Бухгейма. Историческое здание завода сохранилось как памятник промышленной архитектуры.",
        "longitude": 30.2907,
        "latitude": 59.9319,
        "address": "Россия, Санкт-Петербург, 1-я линия Васильевского острова, 28",
        "source": "https://yandex.ru/maps/org/zdanie_byvshego_zavoda_siemens/1024695568/",
        "parentid": 2
    },
    {
        "title": "Дворцовая телеграфная станция в Александрии: Эксплуатация аппаратов Юза",
        "description": "В этом здании 1848 года постройки, входившем в комплекс императорской резиденции, с 1860-х годов использовались аппараты Юза для связи между Петергофом и Санкт-Петербургом. Здесь же в 1897 году тестировались модели с моторным приводом инженера Бухгейма. Сохранившаяся станция сейчас является музеем с оригинальным оборудованием.",
        "longitude": 29.9092,
        "latitude": 59.8838,
        "address": "Россия, Санкт-Петербург, Петергоф, Санкт-Петербургский проспект, 7",
        "source": "https://peterhofmuseum.ru/objects/alexandria/telegraph",
        "parentid": 2
    }
];